package kg.mirlan.fastfood.utils

object Constants {
    val pddTitles = arrayListOf(
        Pair(
            1, "Общие положения"
        ),
        Pair(
            2, "Общие обязанности водителей"
        ),
        Pair(
            3, "Применение специальных сигналов"
        ),
        Pair(
            4, "Права и обязанности пешеходов"
        ),
        Pair(
            5, "Обязанности пассажиров"
        ),
        Pair(
            6, "Сигналы светофора или регулировщика"
        ),
        Pair(
            7, "Применение аварийной сигнализации и знака аварийной остановки"
        ),
        Pair(
            8, "Начало движения, маневрирование"
        ),
        Pair(
            9, "Расположение транспортных средств на проезжей части"
        ),
        Pair(
            10, "Скорость движения и дистанция"
        ),
        Pair(
            11, "Обгон, встречный разъезд"
        ),
        Pair(
            12, "Остановка, стоянка (парковка) транспорта"
        ),
        Pair(
            13, "Проезд перекрестков"
        ),
        Pair(
            14, "Пешеходные переходы и остановки маршрутных транспортных средств"
        ),
        Pair(
            15, "Движение через железнодорожные пути"
        ),
        Pair(
            16, "Движение по автомагистралям"
        ),
        Pair(
            17, "Движение в жилых зонах"
        ),
        Pair(
            18, "Приоритет маршрутных транспортных средств"
        ),
        Pair(
            19, "Пользование внешними световыми приборами"
        ),
        Pair(
            20, "Буксировка механических транспортных средств"
        ),
        Pair(
            21, "Учебная езда"
        ),
        Pair(
            22, "Перевозка людей"
        ),
        Pair(
            23, "Перевозка грузов"
        ),
        Pair(
            24,
            "Дополнительные требования к движению велосипедов, мопедов, гужевых повозок, а также прогону животных"
        ),
        Pair(
            25, "Изменения и дополнения в Правила дорожного движения с 1 апреля 2009 года"
        )

    )
}